*> identifiant du programme
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

*> code à executer (hello world)
PROCEDURE DIVISION.
    DISPLAY "Hello world".  *>affiche le message "Hello world"
    STOP RUN. *>fin du programme
